#include <stdio.h>

int main()
{
    // 记录每次读取后缩短的数字和初始的数字
    int n, n0;

    // 记录数字
    char num[10] = {'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'};
    // 记录单位，舍去前两位
    char unit[10] = {0, 0, 'S', 'B', 'Q', 'W', 'S', 'B', 'Q', 'Y'};
    // 9位数最多有17位输出，result倒着记录输出,即从低位到高位，先单位再数字
    char result[17];

    // 记录每一位读取的数字
    int d;
    // 记录d的前一位，比如d代表十位，则last_d记录的是个位数字，初始时即是个位数字
    int last_d = n % 10;
    // 记录单位位置
    int u = 0;
    // 记录读取了几次，从个位向高位读取，比如count_n=1代表读到了个位，即i代表的是个位数字
    int count_n = 0;
    int j;

    scanf("%d", &n);
    n0 = n;

// 对非0的n进行转换
    while (n > 0)
    {
        // 记录当前末位数字
        d = n % 10;
        // 将舍弃掉末尾数字
        n /= 10;
        count_n++;

        // 如果当前数字是0
        // 个位或万位是0不输出，从十位开始统计
        if (d == 0 && (count_n % 4) > 1)
        {
            // 如果前一位数字不是零，则输出这个0，即a
            // 这样可以保证中间连续多个零时只输出一个零
            if (last_d != 0)
            {
                result[u++] = num[d];
            }
        }

        // 在数字大于一万且万位是0时，万位的W是要强行输出的，
        // 比如100000应该叫十万，但是若是有亿，则不输出，如200000003为两亿零三，中间的万不用输出
        if (count_n == 5 && d == 0 && n0 < 100000000)
        {
            result[u++] = unit[count_n];
        }

        // 输出单位，个位和数字是零则不输出
        if (count_n > 1 && d != 0)
        {
            result[u++] = unit[count_n];
        }

        // 输出非零数字
        if (d != 0)
        {
            result[u++] = num[d];
        }

        // 记录作为前一位数字，用于处理中间的0
        last_d = d;
    }

    // 处理数字0
    if (n0 == 0)
    {
        result[u++] = num[d];
    }

    // 输出结果
    for (j = u - 1; j >= 0; j--)
    {
        printf("%c", result[j]);
    }
    putchar('\n');

    return 0;
}
